text = '''
🔴 00:07 Повітряна тривога в Харківська область
🟢 00:26 Відбій тривоги в Харківська область.
🔴 00:29 Повітряна тривога в Донецька область
🔴 01:01 Повітряна тривога в Миколаївська область
🔴 01:02 Повітряна тривога в Херсонська область
🔴 01:02 Повітряна тривога в Одеська область
🔴 01:03 Повітряна тривога в Кіровоградська область
🔴 01:03 Повітряна тривога в Дніпропетровська область
🔴 01:03 Повітряна тривога в Запорізька область
🟢 01:21 Відбій тривоги в Дніпропетровська область.
🟢 01:22 Відбій тривоги в Кіровоградська область.
🟢 01:22 Відбій тривоги в Запорізька область.
🟢 01:23 Відбій тривоги в Одеська область.
🟡 01:23  Відбій тривоги в Миколаївська область.
🟢 01:23 Відбій тривоги в Херсонська область.
🔴 01:28 Повітряна тривога в Дніпропетровська область
🔴 01:28 Повітряна тривога в Запорізька область
🔴 01:29 Повітряна тривога в Кіровоградська область
🔴 01:58 Повітряна тривога в Миколаївська область
🔴 02:05 Повітряна тривога в Херсонська область
🟢 02:21 Відбій тривоги в Дніпропетровська область.
🟢 02:22 Відбій тривоги в Запорізька область.
🟢 02:50 Відбій тривоги в Донецька область.
🟢 02:58 Відбій тривоги в Кіровоградська область.
🟢 03:06 Відбій тривоги в Херсонська область.
🟢 03:15 Відбій тривоги в Миколаївська область.
'''
total_num = text.count('Херсонська')
alarms_num = total_num / 2
print('Херсонська', alarms_num)
